[
	{
		"title" : "In a bull market, a ____ level is an area that price has difficulty breaking through to the downside.",
		"detail" : "",
		"output" : "In a bull market, a support level is an area that price has difficulty breaking through to the downside.",
		"options" : {
			"a" : "Support",
			"b" : "Retracement",
			"c" : "Resistance",
			"d" : ""
		},
		"correct": "A"
	},
	{
		"title" : "When price breaks through a resistance level, it could potentially become...",
		"detail" : "",
		"output" : "When the forex market moves up and then pulls back, the highest point reached before it pulled back is now resistance. As the market continues up again, the lowest point reached before it started back is now support.",
		"options" : {
			"a" : "Insignificant",
			"b" : "Price never breaks through resistance",
			"c" : "A support level",
			"d" : ""
		},
		"correct": "C"
	},
	{
		"title" : "How many tops or bottoms does it take to confirm a trend line?",
		"detail" : "",
		"output" : "It takes at least two tops or bottoms to draw a valid trend line but it takes THREE to confirm a trend line.",
		"options" : {
			"a" : "Four",
			"b" : "Two",
			"c" : "One",
			"d" : "Three"
		},
		"correct": "D"
	},
	{
		"title" : "When drawing trend lines, you should...",
		"detail" : "",
		"output" : "DO NOT EVER draw trend lines by forcing them to fit the market. If they do not fit right, then that trend line isn’t a valid one!",
		"options" : {
			"a" : "Connect a top and a bottom",
			"b" : "Not connect subsequent tops and bottoms",
			"c" : "Never force them to fit the market",
			"d" : ""
		},
		"correct": "A"
	},
	{
		"title" : "When price is trading within a channel, what is it doing?",
		"detail" : "",
		"output" : "The market is trading within a channel if price trades within two parallel trend lines.",
		"options" : {
			"a" : "Price trades within two intersecting trend lines",
			"b" : "Price trades within two parallel trend lines",
			"c" : "Four green candlesticks form",
			"d" : ""
		},
		"correct": "B"
	},
	{
		"title" : "A descending channel is characterized by...",
		"detail" : "",
		"output" : "A descending channel is characterized by lower highs and lower lows.",
		"options" : {
			"a" : "Higher highs and lower lows",
			"b" : "Same highs and lows",
			"c" : "Higher highs and lows",
			"d" : "Lower highs and lower lows"
		},
		"correct": "D"
	},
	{
		"title" : "Generally, the ___ of a channel is considered to be a ____ zone.",
		"detail" : "",
		"output" : "Generally, the bottom of a channel is considered to be a buy zone.",
		"options" : {
			"a" : "Top, Buy",
			"b" : "Bottom, Buy",
			"c" : "Bottom, Sell",
			"d" : ""
		},
		"correct": "B"
	},
	{
		"title" : "When trading off support and resistance levels, you generally should...",
		"detail" : "",
		"output" : "When playing the bounce, we want to tilt the odds in our favor and find some sort of confirmation that the support or resistance will hold. Instead of simply buying or selling right off the bat, wait for it to bounce first before entering.",
		"options" : {
			"a" : "Wait for price to bounce off the support/resistance level as confirmation that it is holding.",
			"b" : "Place your buy/sell orders past the support/resistance level",
			"c" : "Place your orders right at the support/resistance level",
			"d" : ""
		},
		"correct": "A"
	},
	{
		"title" : "When trading the break of support or resistance levels, the conservative way would be to...",
		"detail" : "",
		"output" : "Instead of entering right on the break, you wait for price to make a “pullback” to the broken support or resistance level and enter after the price bounces.",
		"options" : {
			"a" : "Wait for price to retest the broken support/resistance zone then buy/sell",
			"b" : "Buy/sell before price breaks the support/resistance zone",
			"c" : "Buy/sell when price passes convincingly through the support/resistance zone",
			"d" : ""
		},
		"correct": "A"
	}


]