[
	{
		"title" : "The first step towards determining what type of trader you are is to determine how much _____ you can invest.",
		"detail" : "",
		"output" : "The most important thing you can invest in as a forex trader is your TIME! Every single trading day is a learning experience and if you stop learning, then you will never become a truly successful trader.",
		"options" : {
			"a" : "Meltdowns",
			"b" : "Money",
			"c" : "Time",
			"d" : ""
		},
		"correct": "C"
	},
	
	{
		"title" : "Which of the following should you study least in your market analysis?",
		"detail" : "",
		"output" : "Each day requires your time to analyze the market. Because news makes the market move, it’s important to consider the economic developments going on around the world and to make it part of your daily routine.",
		"options" : {
			"a" : "MLB scores",
			"b" : "Current events",
			"c" : "Chart analysis",
			"d" : ""
		},
		"correct": "C"
	},
	{
		"title" : "If you like fast trading and excitement, ____ might be best for you.",
		"detail" : "",
		"output" : "If you like fast trading and excitement, scalping might be best for you.",
		"options" : {
			"a" : "Swing Trading",
			"b" : "Scalping",
			"c" : "Day Trading",
			"d" : ""
		},
		"correct": "B"
	},
	{
		"title" : "Which of the following probably requires the most time on chart commitment?",
		"detail" : "",
		"output" : "Because scalpers basically have to be glued to the charts, it is best suited for those who can spend several hours of undivided attention to their trading.",
		"options" : {
			"a" : "Scalping",
			"b" : "Day Trading",
			"c" : "Swing Trading",
			"d" : ""
		},
		"correct": "A"
	},
	{
		"title" : "If you're a scalper, which of the following pairs should you trade?",
		"detail" : "",
		"output" : "Pairs such as the EUR/USD, GBP/USD, USD/CHF, and USD/JPY offer the tightest spreads because they tend to have the highest trading volume",
		"options" : {
			"a" : "USD/MXN",
			"b" : "CAD/JPY",
			"c" : "GBP/USD",
			"d" : ""
		},
		"correct": "C"
	},
	{
		"title" : " If you like analyzing the markets at the beginning of the day, monitoring your trade but don't want to leave your position open overnight, ____ might be for you.",
		"detail" : "",
		"output" : "If you like analyzing the markets at the beginning of the day, monitoring your trade but don't want to leave your position open overnight, day trading might be for you.",
		"options" : {
			"a" : "Scalping",
			"b" : "Swing trading",
			"c" : "Day trading",
			"d" : ""
		},
		"correct": "C"
	},
	{
		"title" : "Taking trades against the current direction of price action is more commonly known as...",
		"detail" : "",
		"output" : "Taking trades against the current direction of price action is more commonly known as counter-trend trading.",
		"options" : {
			"a" : "Breakout trading",
			"b" : "Counter-trend trading",
			"c" : "Trend trading",
			"d" : ""
		},
		"correct": "B"
	},
	{
		"title" : "What type of day trading strategy waits for price to bust out of a range before entering?",
		"detail" : "",
		"output" : "Breakout day trading is when you look at the range a pair has made during certain hours of the day and then placing trades on either side, hoping to catch a breakout in either direction.",
		"options" : {
			"a" : "Trend trading",
			"b" : "Counter-trend trading",
			"c" : "Breakout trading",
			"d" : ""
		},
		"correct": "C"
	},
	{
		"title" : "If you have a day job and can only dedicate a couple of hours every day to analyzing the markets, _____ might be best suited for you.",
		"detail" : "",
		"output" : "Swing trading is best suited for those who have full-time jobs or school, but have enough free time to stay up-to-date with what is going on in the global economies.",
		"options" : {
			"a" : "Scalping",
			"b" : "Day trading",
			"c" : "Swing trading",
			"d" : ""
		},
		"correct": "C"
	},
	{
		"title" : "Which of the following might be a reason why you might not want to be a swing trader:",
		"detail" : "",
		"output" : "You might NOT want to be a forex swing trader if you get sweaty and anxious when trades go against you.",
		"options" : {
			"a" : "You don't mind holding your trades for several days.",
			"b" : "You get anxious when your trades go against you.",
			"c" : "You don't mind having large stop losses.",
			"d" : ""
		},
		"correct": "B"
	},
	{
		"title" : "Which of the following is probably the most affected by fundamentals?",
		"detail" : "",
		"output" : "Because position trading is held for so long, fundamental themes will be the predominant focus when analyzing the markets.",
		"options" : {
			"a" : "Position trading",
			"b" : "Day trading",
			"c" : "Swing trading",
			"d" : ""
		},
		"correct": "A"
	},
	{
		"title" : "Which of the following might be a reason why you might not want to be a position trader:",
		"detail" : "",
		"output" : "You might NOT be a forex position trader if you aren’t patient. Even if you are somewhat patient, this still might not be the trading style for you. You have to be the ultimate zen master when it comes to being this kind of patient!",
		"options" : {
			"a" : "You aren't patient.",
			"b" : "You love fundamental analysis.",
			"c" : "You don't mind having super large stop losses.",
			"d" : ""
		},
		"correct": "A"
	}
]